; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_3 ?v3 - type_1 ?v6 - type_3)
 	      (pred_2 ?v2 - object ?v6 - type_3)
	      (pred_4 ?v3 - type_1 ?v1 - type_2)
	      (pred_1 ?v3 - type_1 ?v2 - object ?v1 - type_2))

   (:action op_1
       :parameters  (?v3 - type_1 ?v7 ?v8 - type_3)
       :precondition (and  (pred_3 ?v3 ?v7))
       :effect (and  (pred_3 ?v3 ?v8)
		     (not (pred_3 ?v3 ?v7))))

   (:action op_3
       :parameters (?v3 - type_1 ?v5 - object ?v4 - type_3 ?v1 - type_2)
       :precondition  (and  (pred_2 ?v5 ?v4) (pred_3 ?v3 ?v4) (pred_4 ?v3 ?v1))
       :effect (and (pred_1 ?v3 ?v5 ?v1)
		    (not (pred_2 ?v5 ?v4)) 
		    (not (pred_4 ?v3 ?v1))))

   (:action op_2
       :parameters (?v3 - type_1 ?v5 - object ?v4 - type_3 ?v1 - type_2)
       :precondition  (and  (pred_1 ?v3 ?v5 ?v1) (pred_3 ?v3 ?v4))
       :effect (and (pred_2 ?v5 ?v4)
		    (pred_4 ?v3 ?v1)
		    (not (pred_1 ?v3 ?v5 ?v1)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_04 - type_1
obj_07 obj_09 - type_2
obj_01 obj_03 obj_06 - type_3
obj_02 obj_08 obj_05 - object)
(:init
(pred_3 obj_04 obj_03)
(pred_4 obj_04 obj_07)
(pred_4 obj_04 obj_09)
(pred_2 obj_02 obj_06)
(pred_2 obj_08 obj_03)
(pred_2 obj_05 obj_01)
)
(:goal
(and
(pred_2 obj_02 obj_03)
(pred_2 obj_08 obj_03)
(pred_2 obj_05 obj_01)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_1 obj_04 ?b obj_09))))
)
)

; plan
1. (op_1 obj_04 obj_03 obj_06)
   deleted: (pred_3 obj_04 obj_03)
   added: (pred_3 obj_04 obj_06)
   goals met: 2 of 3
2. (op_3 obj_04 obj_02 obj_06 obj_07)
   deleted: (pred_2 obj_02 obj_06) (pred_4 obj_04 obj_07)
   added: (pred_1 obj_04 obj_02 obj_07)
   goals met: 2 of 3
3. (op_1 obj_04 obj_06 obj_03)
   deleted: (pred_3 obj_04 obj_06)
   added: (pred_3 obj_04 obj_03)
   goals met: 2 of 3
4. (op_2 obj_04 obj_02 obj_03 obj_07)
   deleted: (pred_1 obj_04 obj_02 obj_07)
   added: (pred_2 obj_02 obj_03) (pred_4 obj_04 obj_07)
   goals met: 3 of 3
